Autodesk.Revit.DB.IFC.ExporterIFC.GetFamilyInstanceAssemblyOffset(Autodesk.Revit.DB.FamilyInstance)
Obtains Translation to adjust Family Instance within an Assembly, based on Family Symbol origin change.
familyInstance:
The family instance.
Returns:
Translation for Family Instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFC.ExporterIFC.GetLayerNameForPresentationLayer(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Get the layer name associated with an element from the default layer mapping table.
pElement:
The element.
categoryId:
The category id of the element.
Returns:
The layer name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.IFC.ExporterIFC.GetPresentationLayerAssignments
Get the list of the internally IfcPresentationLayerAssignments and their respective shape representations.
Returns:
The map.
Since:
2022

Autodesk.Revit.DB.IFC.ExporterIFC.GetOrCreateFillPattern(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Color,System.Double)
Get (or create) the IfcFillPatternStyle associated with an ElementId.
fillPatternId:
The fill pattern id.
color:
The pattern color.
planScale:
The view scale.
Returns:
The IfcSurfaceStyle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetRelatedElements
Gets all elements not associated to stories.
Returns:
The collection of elements.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetRelatedProducts
Gets all products not associated to stories.
Returns:
The collection of products.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetMaterialIdForCurrentExportState(Autodesk.Revit.DB.ElementId)
This sets the material id that is to be associated with the element in the current export state.
Remarks:
Even though there could be several materials associated with the element (set during PushExportState()),
unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
elementId:
The material id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.GetMaterialIdForCurrentExportState
This gets the material id that is associated with the element in the current export state.
Remarks:
Even though there could be several materials associated with the element (set during PushExportState()),
unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
Returns:
The material id.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetFamilyName
Gets the name of the element assigned to the current export state.
Remarks:
The family name is prepared for use in IFC output during the call to PushExportState().
Returns:
The family name.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.PopExportState
Resets the internal state of the exporter to process the previously active input element (if any), or
the default state if the stack is empty.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.PushExportState(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.GeometryElement)
Sets the internal state of the exporter to process the geometry and properties of the input element.
Remarks:
The element will be assigned until PopExportState() is called.
Elem:
The element.
GRep:
The geometry of the element.  Optional, can be null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.SetCurrentExportedDocument(Autodesk.Revit.DB.Document)
Sets the exporter to process a particular document during export.
Remarks:
This is intended for use in federated export.
pDocument:
The document being processed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023.1

Autodesk.Revit.DB.IFC.ExporterIFC.GetDoorWindowOpeningHandle(Autodesk.Revit.DB.ElementId)
Get the handle to the opening associated with a hosted (door/window) element from the internal cache.
familyInstanceId:
The id of the door or window.
Returns:
The opening handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterDoorWindowForUncreatedOpening(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Registers a door or window in the ExporterIFC's internal cache.  The ids registered correspond to
openings in walls which have not been processed and created yet.
familyInstanceId:
The id of the door or window.
instanceHandle:
The handle to the IfcDoor or IfcWindow created for this instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.Set3DContextHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle,System.String)
Sets the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
contextHandle:
The IfcRepresentationContext for 3D entities.
subContextName:
The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.Get3DContextHandle(System.String)
Obtains the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
Remarks:
The context handle automatically incorporates the angle to true north for the document.
subContextName:
The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.
Returns:
The IfcRepresentationContext for 3D entities.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.ClearFaceWithElementHandleMap
Clear face with element handle map.
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterFaceWithElementHandle(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Register face with element handle to make sure the openings created are related to the right element.
face:
The face.
elemHandle:
The element handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.GetHostObjects
Returns a collection containing the host object handles in the document.
Remarks:
Host object handles is currently collected by RegisterSpaceBoundingElementHandle
and exporting internal element and cached in the ExporterIFC object.
This method returns the cached information which is needed to create wall connectivity objects.
Returns:
The collection of host objects.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.FindSpaceBoundingElementHandle(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Looks up the handle associated to the element and level id from the ExporterIFC's internal cache.
id:
The Revit element id to look for.
levelId:
The element level id.
Returns:
The handle associated to the element and level id.  If the id is not found in the cache, an empty handle
is returned (HasValue == false).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterSpaceBoundingElementHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Stores a handle representing a space bounding element to the ExporterIFC's internal cache.
Remarks:
The cache of space bounding elements will be used during completion of export to create
relationship objects such as IfcRelSpaceBoundary and IfcRelConnectsPathElements.
The types of Revit elements accepted by this function are:
WallsCurtain wallsRoofsFloorsDoorsWindows
instanceHandle:
The handle to the space bounding element.
id:
The Revit element id associated to this handle.
levelId:
The level id assigned to the space bounding object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.GetOptions
Gets the collection of named options set by the exporter client.
Returns:
The collection of named options.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetOwnerHistoryHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handle to the IfcOwnerHistory for the file.
ownerHistory:
The handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
Sets the handle to the IFC file being created during this export operation.
file:
The handle to the file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.PopTransform
Resets the internal transform of the exporter to process the previously active input element (if any), or
the default transform if the stack is empty.
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.PushTransform(Autodesk.Revit.DB.Transform)
Sets the internal transform of the exporter to process the geometry and properties of the input element.
trf:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.GetFile
Gets the handle to the IFC file being created during this export operation.
Returns:
The handle to the file.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.WallAndColumnSplitting
Identifies if division of multi-level walls and columns by levels should take place during this export.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.SpaceBoundaryLevel
Identifies the level of space boundaries being exported.
Remarks:
There are three valid values for this integer:
0 = export no space boundaries.  This can save space if the receiving application doesn't use them.
1 = export 1st level space boundaries.  This is the default.
2 = export 2nd level space boundaries.  This is primarily for use in energy analysis programs, and the GSA.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.ExportBaseQuantities
Identifies if the export should include IFC standard quantities currently supported by Revit.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.FileVersion
Identifies the file version being exported.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.FileName
The name of the IFC file being exported.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC
The main class provided by Revit to allow implementation of IFC export.
Remarks:
An instance of this class is provided to clients which implement IExporterIFC
in order to provide an implementation for IFC export.  It contains information
on the options selected by the user for the export operation, as well as
members used to access specific types of data needed to implement the export
properly.
Since:
2012